export class ConstsChangxing {
    static readonly yibaoConfig = {
        xb: {
            "1": "男",
            "2": "女",
            "9": "不确定"
        },
        cbxz: {
            "310": "城镇职工基本医疗保险",
            "390": "城镇居民医疗保险",
            "340": "离休"
        },
        rylb: {
            "10": "公务员在职",
            "11": "公务员在职（40岁及以下）",
            "12": "公务员在职（41岁及以上）",
            "13": "参照公务员在职",
            "14": "事业在职",
            "15": "企业在职",
            "16": "企业在职（门诊统筹）",
            "20": "公务员退休",
            "23": "参照公务员退休",
            "24": "事业退休",
            "25": "企业退休",
            "26": "企业退休（门诊统筹）",
            "30": "军转企在职",
            "31": "军转企退休",
            "32": "军转公",
            "33": "军转特",
            "34": "灵活就业",
            "35": "政调企在职",
            "36": "政调企退休",
            "40": "离休人员",
            "45": "建国前老工人",
            "50": "离休配偶",
            "51": "离休遗孀",
            "61": "二等乙级",
            "62": "老红军",
            "63": "复退军人",
            "64": "战士",
            "65": "一至六级残疾军人",
            "66": "医疗照顾人员",
            "67": "矽肺人员",
            "70": "学龄前儿童",
            "71": "未成年学生",
            "72": "成年学生",
            "73": "在校学生",
            "74": "学生儿童",
            "75": "中小学生",
            "76": "大学生",
            "80": "成年居民(非从业)",
            "81": "成年人",
            "82": "老年居民",
            "91": "其它特殊人员",
            "92": "其他居民医疗人员"
        }
    };
}