export class Consts<%= classify(name) %> {
    static readonly yibaoConfig = {
        xb: {
            "1": "男",
            "2": "女",
            "9": "不确定"
        },
        dylb: {
            "00": "无医保待遇",
            "11": "在职",
            "12": "在职公务员",
            "13": "在职自谋职业",
            "14": "在职改制人员",
            "15": "在职机关事业",
            "21": "退休",
            "22": "退休公务员",
            "23": "退休自谋职业",
            "24": "退休改制人员",
            "25": "退休机关事业",
            "31": "离休",
            "32": "离休干部配偶或遗孀（事业）",
            "33": "二等乙级以上革命伤残军人",
            "34": "建国前老工人",
            "35": "离休干部配偶或遗孀（企业）",
            "40": "成年人",
            "41": "未成年人"
        },
        yypc: [
            { code: "11", name: "每天一次" },
            { code: "12", name: "每天二次" },
            { code: "13", name: "每天三次" },
            { code: "14", name: "每天四次" },
            { code: "15", name: "每天五次" },
            { code: "21", name: "每周一次" },
            { code: "22", name: "每周二次" },
            { code: "23", name: "每周三次" },
            { code: "30", name: "每半小时一次" },
            { code: "31", name: "每小时一次" },
            { code: "32", name: "每2小时一次" },
            { code: "33", name: "每4小时一次" },
            { code: "34", name: "每5小时一次" },
            { code: "35", name: "每6小时一次" },
            { code: "36", name: "每8小时一次" },
            { code: "37", name: "每12小时一次" },
            { code: "38", name: "每3小时一次" },
            { code: "41", name: "每晚一次" },
            { code: "42", name: "隔天一次" },
            { code: "43", name: "五天一次" },
            { code: "44", name: "十天一次" },
            { code: "45", name: "每三天一次" },
            { code: "46", name: "每二周一次" },
            { code: "51", name: "12小时维持" },
            { code: "52", name: "24小时维持" },
            { code: "61", name: "立即" },
            { code: "62", name: "必要时使用" }
        ]
    }
}